tiwater/arduino-esp32/boards.txt
Ticos-kit-dimoca.menu.CPUFreq.240=240MHz (WiFi)
Ticos-kit-dimoca.menu.CPUFreq.240.build.f_cpu=240000000L
Ticos-kit-dimoca.menu.CPUFreq.160=160MHz (WiFi)
Ticos-kit-dimoca.menu.CPUFreq.160.build.f_cpu=160000000L
Ticos-kit-dimoca.menu.CPUFreq.80=80MHz (WiFi)
Ticos-kit-dimoca.menu.CPUFreq.80.build.f_cpu=80000000L
Ticos-kit-dimoca.menu.CPUFreq.40=40MHz
Ticos-kit-dimoca.menu.CPUFreq.40.build.f_cpu=40000000L
Ticos-kit-dimoca.menu.CPUFreq.20=20MHz
Ticos-kit-dimoca.menu.CPUFreq.20.build.f_cpu=20000000L
Ticos-kit-dimoca.menu.CPUFreq.10=10MHz
Ticos-kit-dimoca.menu.CPUFreq.10.build.f_cpu=10000000L

Ticos-kit-dimoca.menu.FlashMode.qio=QIO
Ticos-kit-dimoca.menu.FlashMode.qio.build.flash_mode=dio
Ticos-kit-dimoca.menu.FlashMode.qio.build.boot=qio
Ticos-kit-dimoca.menu.FlashMode.dio=DIO
Ticos-kit-dimoca.menu.FlashMode.dio.build.flash_mode=dio
Ticos-kit-dimoca.menu.FlashMode.dio.build.boot=dio
Ticos-kit-dimoca.menu.FlashMode.qout=QOUT
Ticos-kit-dimoca.menu.FlashMode.qout.build.flash_mode=dout
Ticos-kit-dimoca.menu.FlashMode.qout.build.boot=qout
Ticos-kit-dimoca.menu.FlashMode.dout=DOUT
Ticos-kit-dimoca.menu.FlashMode.dout.build.flash_mode=dout
Ticos-kit-dimoca.menu.FlashMode.dout.build.boot=dout

Ticos-kit-dimoca.menu.FlashFreq.80=80MHz
Ticos-kit-dimoca.menu.FlashFreq.80.build.flash_freq=80m
Ticos-kit-dimoca.menu.FlashFreq.40=40MHz
Ticos-kit-dimoca.menu.FlashFreq.40.build.flash_freq=40m

Ticos-kit-dimoca.menu.FlashSize.4M=4MB (32Mb)
Ticos-kit-dimoca.menu.FlashSize.4M.build.flash_size=4MB
Ticos-kit-dimoca.menu.FlashSize.8M=8MB (64Mb)
Ticos-kit-dimoca.menu.FlashSize.8M.build.flash_size=8MB
Ticos-kit-dimoca.menu.FlashSize.8M.build.partitions=default_8MB
Ticos-kit-dimoca.menu.FlashSize.2M=2MB (16Mb)
Ticos-kit-dimoca.menu.FlashSize.2M.build.flash_size=2MB
Ticos-kit-dimoca.menu.FlashSize.2M.build.partitions=minimal
Ticos-kit-dimoca.menu.FlashSize.16M=16MB (128Mb)
Ticos-kit-dimoca.menu.FlashSize.16M.build.flash_size=16MB

Ticos-kit-dimoca.menu.UploadSpeed.921600=921600
Ticos-kit-dimoca.menu.UploadSpeed.921600.upload.speed=921600
Ticos-kit-dimoca.menu.UploadSpeed.115200=115200
Ticos-kit-dimoca.menu.UploadSpeed.115200.upload.speed=115200
Ticos-kit-dimoca.menu.UploadSpeed.256000.windows=256000
Ticos-kit-dimoca.menu.UploadSpeed.256000.upload.speed=256000
Ticos-kit-dimoca.menu.UploadSpeed.230400.windows.upload.speed=256000
Ticos-kit-dimoca.menu.UploadSpeed.230400=230400
Ticos-kit-dimoca.menu.UploadSpeed.230400.upload.speed=230400
Ticos-kit-dimoca.menu.UploadSpeed.460800.linux=460800
Ticos-kit-dimoca.menu.UploadSpeed.460800.macosx=460800
Ticos-kit-dimoca.menu.UploadSpeed.460800.upload.speed=460800
Ticos-kit-dimoca.menu.UploadSpeed.512000.windows=512000
Ticos-kit-dimoca.menu.UploadSpeed.512000.upload.speed=512000

Ticos-kit-dimoca.menu.DebugLevel.none=None
Ticos-kit-dimoca.menu.DebugLevel.none.build.code_debug=0
Ticos-kit-dimoca.menu.DebugLevel.error=Error
Ticos-kit-dimoca.menu.DebugLevel.error.build.code_debug=1
Ticos-kit-dimoca.menu.DebugLevel.warn=Warn
Ticos-kit-dimoca.menu.DebugLevel.warn.build.code_debug=2
Ticos-kit-dimoca.menu.DebugLevel.info=Info
Ticos-kit-dimoca.menu.DebugLevel.info.build.code_debug=3
Ticos-kit-dimoca.menu.DebugLevel.debug=Debug
Ticos-kit-dimoca.menu.DebugLevel.debug.build.code_debug=4
Ticos-kit-dimoca.menu.DebugLevel.verbose=Verbose
Ticos-kit-dimoca.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

esp32s3.name=ESP32S3 Dev Module
esp32s3.vid.0=0x303a
esp32s3.pid.0=0x1001

esp32s3.upload.tool=esptool_py
esp32s3.upload.maximum_size=1310720
esp32s3.upload.maximum_data_size=327680
esp32s3.upload.flags=
esp32s3.upload.extra_flags=
esp32s3.upload.use_1200bps_touch=false
esp32s3.upload.wait_for_upload_port=false

esp32s3.serial.disableDTR=false
esp32s3.serial.disableRTS=false

esp32s3.build.tarch=xtensa
esp32s3.build.bootloader_addr=0x0
esp32s3.build.target=esp32s3
esp32s3.build.mcu=esp32s3
esp32s3.build.core=esp32
esp32s3.build.variant=esp32s3
esp32s3.build.board=ESP32S3_DEV

esp32s3.build.usb_mode=1
esp32s3.build.cdc_on_boot=0
esp32s3.build.msc_on_boot=0
esp32s3.build.dfu_on_boot=0
esp32s3.build.f_cpu=240000000L
esp32s3.build.flash_size=4MB
esp32s3.build.flash_freq=80m
esp32s3.build.flash_mode=dio
esp32s3.build.boot=qio
esp32s3.build.boot_freq=80m
esp32s3.build.partitions=default
esp32s3.build.defines=
esp32s3.build.loop_core=
esp32s3.build.event_core=
esp32s3.build.flash_type=qspi
esp32s3.build.psram_type=qspi
esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

#esp32s3.menu.MemoryType.default=QSPI Flash and PSRAM
#esp32s3.menu.MemoryType.default.build.memory_type=qspi_qspi
#esp32s3.menu.MemoryType.qspi_opi=QSPI Flash and OPI PSRAM
#esp32s3.menu.MemoryType.qspi_opi.build.memory_type=qspi_opi
#esp32s3.menu.MemoryType.opi_opi=OPI Flash and PSRAM
#esp32s3.menu.MemoryType.opi_opi.build.memory_type=opi_opi

esp32s3.menu.PSRAM.disabled=Disabled
esp32s3.menu.PSRAM.disabled.build.defines=
esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3.menu.PSRAM.enabled=QSPI PSRAM
esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3.menu.PSRAM.opi=OPI PSRAM
esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.opi.build.psram_type=opi

esp32s3.menu.FlashMode.qio=QIO 80MHz
esp32s3.menu.FlashMode.qio.build.flash_mode=dio
esp32s3.menu.FlashMode.qio.build.boot=qio
esp32s3.menu.FlashMode.qio.build.boot_freq=80m
esp32s3.menu.FlashMode.qio.build.flash_freq=80m
esp32s3.menu.FlashMode.qio.build.flash_type=qspi
esp32s3.menu.FlashMode.qio120=QIO 120MHz
esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3.menu.FlashMode.qio120.build.boot=qio
esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3.menu.FlashMode.qio120.build.flash_type=qspi
esp32s3.menu.FlashMode.dio=DIO 80MHz
esp32s3.menu.FlashMode.dio.build.flash_mode=dio
esp32s3.menu.FlashMode.dio.build.boot=dio
esp32s3.menu.FlashMode.dio.build.boot_freq=80m
esp32s3.menu.FlashMode.dio.build.flash_freq=80m
esp32s3.menu.FlashMode.dio.build.flash_type=qspi
esp32s3.menu.FlashMode.opi=OPI 80MHz
esp32s3.menu.FlashMode.opi.build.flash_mode=dout
esp32s3.menu.FlashMode.opi.build.boot=opi
esp32s3.menu.FlashMode.opi.build.boot_freq=80m
esp32s3.menu.FlashMode.opi.build.flash_freq=80m
esp32s3.menu.FlashMode.opi.build.flash_type=opi

